Repository: Microsoft/visualfsharp
Catalog: src/fsharp/FSharp.Core/xlf/FSCore.*.xlf
Languages: fi

# matchCasesIncomplete
source: The match cases were incomplete
fi: Match-lause vuotaa arvoja

# addressOpNotFirstClass
source: First class uses of address-of operators are not permitted.
fi: Ensimmäisen luokan address-of operaatiot eivät ole sallittu.

# arraysHadDifferentLengths
source: The arrays have different lengths.
fi: Array-tietueiden pituudet eivät täsmää.

# arrayWasEmpty
source: The input array was empty.
fi: Syöte-array oli tyhjä.

# badFormatString
source: Input string was not in a correct format.
fi: Syöttömerkkijono ei ollut oikeassa muodossa.

# delegateExpected
source: Expecting delegate type.
fi: Odotettiin delegaatti-tyyppiä.

# dyInvDivByIntCoerce
source: Dynamic invocation of DivideByInt involving coercions is not supported.
fi: DivideByInt dynaamista kutsua pakolla (coerscion) ei tueta.

# dyInvOpAddCoerce
source: Dynamic invocation of op_Addition involving coercions is not supported.
fi: Metodin op_Addition dynaamista kutsua pakolla (coerscion) ei tueta.

# dyInvOpAddOverload
source: Dynamic invocation of op_Addition involving overloading is not supported.
fi: Metodin op_Addition dynaamista kutsua ylikuormituksella ei tueta.

# dyInvOpMultCoerce
source: Dynamic invocation of op_Multiply involving coercions is not supported.
fi: Metodin op_Multiply dynaamista kutsua pakolla (coerscion) ei tueta.

# dyInvOpMultOverload
source: Dynamic invocation of op_Multiply involving overloading is not supported.
fi: Metodin op_Multiply dynaamista kutsua ylikuormituksella ei tueta.

# endCannotBeNaN
source: The end of a range cannot be NaN.
fi: Alueen loppu ei voi olla ei-numeerinen (NaN).

source: Enumeration already finished.
fi: Luettelu on jo suoritettu loppuun.

# enumerationNotStarted
source: Enumeration has not started. Call MoveNext.
fi: Luettelu ei ole alkanut. Kutsu MoveNext.

source: Set contains no elements.
fi: Sarja (Set) ei sisällä elementtejä.

# enumerationPastIntMaxValue
source: Enumeration based on System.Int32 exceeded System.Int32.MaxValue.
fi: Luettelo tyypiltään System.Int32 ylitti System.Int32.MaxValue.

# failedReadEnoughBytes
source: Failed to read enough bytes from the stream.
fi: Syötevirrasta ei voitu lukea tarpeeksi tavuja.

# genericCompareFail1
source: Failure during generic comparison: the type '{0}' does not implement the System.IComparable interface. This error may be arise from the use of a function such as 'compare', 'max' or 'min' or a data structure such as 'Set' or 'Map' whose keys contain instances of this type.
fi: Vika yleisen vertailun aikana: tyyppi '{0}' ei toteuta rajapintaa System.IComparable. Tämä virhe voi johtua funktion käytöstä (kuten 'compare', 'max' o 'min'), tai tietorakenteesta (kuten 'Set' tai 'Map') jonka avaimet sisältävät instanssin tästä tyypistä.

# indexOutOfBounds
source: The index was outside the range of elements in the list.
fi: Indeksi oli listan elementtialueen ulkopuolella.

# inputListWasEmpty
source: The input list was empty.
fi: Syötelista oli tyhjä.

# inputMustBeNonNegative
source: The input must be non-negative.
fi: Syöte ei saa olla negatiivinen.

# inputMustBePositive
source: The input must be positive.
fi: Syötteen on oltava positiivinen.

# inputSequenceEmpty
source: The input sequence was empty.
fi: Syötesarja oli tyhjä.

# invalidTupleTypes
source: This is not a valid tuple type for the F# reflection library.
fi: Tämä ei ole laillinen monikko (tuple) -tyyppi F# reflektiokirjastolle.

# keyNotFound
source: The item, key, or index was not found in the collection.
fi: Asia, avain tai indeksi ei löytynyt kokoelmasta.

# listsHadDifferentLengths
source: The lists had different lengths.
fi: Listat ovat eripituiset.

# mailboxProcessorAlreadyStarted
source: The MailboxProcessor has already been started.
fi: MailboxProcessor on jo käynnissä.

source: MailboxProcessor.PostAndAsyncReply timed out.
fi: MailboxProcessor.PostAndAsyncReply aika loppui kesken.

source: MailboxProcessor.PostAndReply timed out.
fi: MailboxProcessor.PostAndReply aika loppui kesken.

source: Mailbox.Receive timed out.
fi: Mailbox.Receive aika loppui kesken.

source: Mailbox.Scan timed out.
fi: Mailbox.Scan aika loppui kesken.

# mapCannotBeMutated
source: Map values cannot be mutated.
fi: Map arvoja ei voi muokata.

# mismatchIARCancel
source: The IAsyncResult object provided does not match this 'Cancel' operation.
fi: Annettu IAsyncResult-objekti ei vastaa tätä 'Cancel' -toimintoa.

# mismatchIAREnd
source: The IAsyncResult object provided does not match this 'End' operation.
fi: Annettu IAsyncResult-objekti ei vastaa tätä 'End' -operaatiota.

# noNegateMinValue
source: Negating the minimum value of a twos complement number is invalid.
fi: Kaksoiskomplementin luvun vähimmäisarvon negatointi on virheellinen.

# checkInit
source: The initialization of an object or value resulted in an object or value being accessed recursively before it was fully initialized.
fi: Objektin tai arvon alustus johti siihen, että objektia tai arvoa käytettiin rekursiivisesti ennen sen alustamista kokonaan.

# checkStaticInit
source: The static initialization of a file or type resulted in static data being accessed recursively before it was fully initialized.
fi: Tiedoston tai tyypin staattinen alustaminen johti siihen, että staattista dataa käsiteltiin rekursiivisesti ennen sen alustamista kokonaan.

# nonZeroBasedDisallowed
source: Arrays with non-zero base cannot be created on this platform.
fi: Tälle alustalle ei voida luoda taulukkoja, jotka eivät ala indeksistä nolla.

# notAFunctionType
source: Type '{0}' is not a function type.
fi: Tyyppi '{0}' ei ole kutsuttava funktion tyyppi.

# notAnExceptionType
source: Type '{0}' is not the representation of an F# exception declaration.
fi: Tyyppi '{0}' ei edusta F# poikkeusmäärittelyjä.

# notAPermutation
source: The function did not compute a permutation.
fi: Funktio ei laskenut permutaatiota.

# notARecordType
source: Type '{0}' is not an F# record type.
fi: Tyyppi '{0}' ei ole F# tietue (record) tyyppiä.

# notATupleType
source: Type '{0}' is not a tuple type.
fi: Tyyppi '{0}' ei ole monikko (tuple).

# notAUnionType
source: Type '{0}' is not an F# union type.
fi: Tyyppi '{0}' ei ole F# yhdiste (union).

# notComparable
source: The two objects have different types and are not comparable.
fi: Kahdessa objektissa on erityyppisiä tyyppejä, eikä niitä voida verrata toisiinsa.

# notEnoughElements
source: The input sequence has an insufficient number of elements.
fi: Syöttöjaksossa on riittämätön määrä elementtejä.

# notUsedForHashing
source: This object is for recursive equality calls and cannot be used for hashing.
fi: Tämä objekti on tarkoitettu rekursiivisille yhtäläisyyskutsuille, eikä sitä voida käyttää tarkistelaskentaan.

# nullsNotAllowedInArray
source: One of the elements in the array is null.
fi: Yksi taulukon elementeistä on tyhjä (null).

# objIsNotARecord
source: The object is not an F# record value.
fi: Objekti ei ole F#-tietueen (record) arvo.

# objIsNullAndNoType
source: The object is null and no type was given. Either pass a non-null object or a non-null type parameter.
fi: Objekti on tyhjä (null) eikä tyyppiä ole määritelty. Välitä joko ei-nolla-objekti tai anna tyyppi-parametri.

# outOfRange
source: The index is outside the legal range.
fi: Indeksi on laillisen alueen ulkopuolella.

# privateExceptionType
source: The type '{0}' is the representation of an F# exception declaration but its representation is private. You must specify BindingFlags.NonPublic to access private type representations.
fi: Tyyppi '{0}' on F # -poikkeusilmoituksen määrittely, mutta sen esiintymä on yksityinen. On asetettava BindingFlags.NonPublic päästäksesi käsiksi yksityisiin tyyppimäärittelyihin.

# privateRecordType
source: The type '{0}' is an F# record type but its representation is private. You must specify BindingFlags.NonPublic to access private type representations.
fi: Tyyppi '{0}' on F # tietuetyyppi, mutta sen esiintymä on yksityinen. On asetettava BindingFlags.NonPublic päästäksesi käsiksi yksityisiin tyyppimäärittelyihin.

# privateUnionType
source: The type '{0}' is an F# union type but its representation is private. You must specify BindingFlags.NonPublic to access private type representations.
fi: Tyyppi '{0}' on F # unionityyppi, mutta sen esiintymä on yksityinen. On asetettava BindingFlags.NonPublic päästäksesi käsiksi yksityisiin tyyppimäärittelyihin.

# QexpectedOneType
source: Expected exactly one type argument.
fi: Odotettiin tarkalleen yhtä tyyppiargumenttia.

# QexpectedTwoTypes
source: Expected exactly two type arguments.
fi: Odotettiin tarkalleen kahta tyyppiargumenttia.

# QinvalidCaseIndex
source: Not a valid F# union case index.
fi: Epäkelpo F#-unionin tapauksen indeksi.

# QmissingRecordField
source: Type '{0}' did not have an F# record field named '{1}'.
fi: Tyypillä '{0}' ei ollut F#-rekisterikenttää nimeltä '{1}'.

# QmissingUnionCase
source: Type '{0}' did not have an F# union case named '{1}'.
fi: Tyypillä '{0}' ei ollut F#-unionitapausta nimeltä '{1}'.

# QtmmBadFieldType
source: Type mismatch when building '{0}': the type of the field was incorrect. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Kentän tyyppi oli väärä. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmBodyMustBeUnit
source: Type mismatch when building '{0}': body must return unit. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Ohjelmakoodin on palautettava "unit". Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmCondMustBeBool
source: Type mismatch when building '{0}': condition expression must be of type bool. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Ehtolauseen on oltava tyyppiä bool. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmExpectedFunction
source: Type mismatch when building '{0}': expected function type in function application or let binding. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Odotettu funktion tyyppi aplikaatiossa tai let-määrittelyssä. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmExprNotMatchTuple
source: Type mismatch when building '{0}': expression doesn't match the tuple type. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Lauseke ei vastaa tuple-tyyppiä. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmExprTypeMismatch
source: Type mismatch when building '{0}': types of expression does not match. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Lausekkeen tyypit eivät täsmää. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmFunctionArgTypeMismatch
source: Type mismatch when building '{0}': function argument type doesn't match. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Funktioargumentin tyyppi ei täsmää. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmGuardMustBeBool
source: Type mismatch when building '{0}': guard must return boolean. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Vartija-ehtolauseen on palautettava bool. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmIncorrectArgForRecord
source: Type mismatch when building '{0}': incorrect argument type for an F# record. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Väärä argumenttityyppi F#-tietueelle. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmIncorrectArgForUnion
source: Type mismatch when building '{0}': incorrect argument type for an F# union. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Väärä argumentti tyyppi F#-unionille. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmInitArray
source: Type mismatch when building '{0}': initializer doesn't match array type. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Alustus ei vastaa array-tyyppiä. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmInvalidParam
source: Type mismatch when building '{0}': invalid parameter for a method or indexer property. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Virheellinen parametri menetelmälle tai indeksoijaominaisuudelle. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmLoopBodyMustBeLambdaTakingInteger
source: Type mismatch when building '{0}': body of the for loop must be lambda taking integer as an argument. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': for-silmukan rungon on oltava lambda ottaen argumentiksi kokonaisluvun. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmLowerUpperBoundMustBeInt
source: Type mismatch when building '{0}': lower and upper bounds must be integers. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Ala- ja ylärajojen on oltava kokonaislukuja. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmTrueAndFalseMustMatch
source: Type mismatch when building '{0}': types of true and false branches differ. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Tosi ja epätosi -haarojen paluutyypit eroavat toisistaan. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmTuple
source: Type mismatch when building '{0}': mismatched type of argument and tuple element. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Argumentin ja tuple-elementin tyyppiyhteensopimattomuus. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmVarTypeNotMatchRHS
source: Type mismatch when building '{0}': the variable type doesn't match the type of the right-hand-side of a let binding. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Muuttujan tyyppi ei vastaa let-määrittelyn oikeanpuoleista tyyppiä. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QunexpectedHole
source: Unexpected quotation hole in expression.
fi: Odottamaton lainausreikä lausekkeessa.

# QunrecognizedMethodCall
source: The parameter is not a recognized method name.
fi: Parametri ei ole tunnistettu menetelmän nimi.

# resetNotSupported
source: Reset is not supported on this enumerator.
fi: Resetointia ei tueta tässä luettelossa.

# startCannotBeNaN
source: The start of a range cannot be NaN.
fi: Alueen alku ei voi olla epänumeerinen (NaN).

# stepCannotBeNaN
source: The step of a range cannot be NaN.
fi: Alueen askel ei voi olla epänumeerinen (NaN).

# stepCannotBeZero
source: The step of a range cannot be zero.
fi: Alueen askel ei voi olla nolla.

# syncContextNull
source: The System.Threading.SynchronizationContext.Current of the calling thread is null.
fi: System.Threading.SynchronizationContext.Current kutsujasäikeessä on tyhjä (null).

# tupleIndexOutOfRange
source: The tuple index '{1}' was out of range for tuple type '{0}'.
fi: Tuple-indeksi '{1}' oli tupletyypin '{0}' alueen ulkopuolella.

# QfailedToBindConstructor
source: Failed to bind constructor
fi: Konstruktorin määritelmä epäonnistui.

# QfailedToBindField
source: Failed to bind field '{0}'
fi: Kentän '{0}' määritelmä epäonnistui.

# QfailedToBindProperty
source: Failed to bind property '{0}'
fi: Ominaisuuden '{0}' määritelmä epäonnistui.

# QfailedToBindTypeInAssembly
source: Failed to bind type '{0}' in assembly '{1}'
fi: Tyypin asetus epäonnistui '{0}' kohteessa '{1}'.

# QincompatibleRecordLength
source: Incompatible record length
fi: Yhteensopimaton tietueen pituus.

# QincorrectInstanceType
source: Incorrect instance type
fi: Väärä ilmentymätyyppi.

# QincorrectNumArgs
source: Incorrect number of arguments
fi: Argumenttien määrä ei täsmää.

# QincorrectType
source: Incorrect type
fi: Virheellinen tietotyyppi.

# QinvalidFuncType
source: Invalid function type
fi: Virheellinen funktion tyyppi.

# QnonStaticNoReceiverObject
source: The member is non-static (instance), but no receiver object was supplied
fi: Jäsen ei ole staattinen (esiintymä), mutta vastaanottajaobjektia ei annettu.

# QparentCannotBeNull
source: Parent type cannot be null
fi: Kantatyyppi ei voi olla tyhjä (null).

# QreadingSetOnly
source: Reading a set-only property
fi: Vain-set-ominaisuutta ei voi lukea.

# QstaticWithReceiverObject
source: Receiver object was unexpected, as member is static
fi: Staattisen jäsenen odottamaton vastaanottajaobjekti.

# QtmmExprHasWrongType
source: Type mismatch when building '{0}': the expression has the wrong type. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Lausekkeen tyyppi on väärin. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmFunTypeNotMatchDelegate
source: Type mismatch when building '{0}': function type doesn't match delegate type. Expected '{1}', but received type '{2}'.
fi: Tyyppiyhteensopimattomuus rakennettaessa '{0}': Funktion tyyppi ei vastaa delegaattia. Odotettu '{1}', mutta vastaanotettu tyyppi '{2}'.

# QtmmRaw
source: Type mismatch when splicing expression into quotation literal. The type of the expression tree being inserted doesn't match the type expected by the splicing operation. Expected '{0}', but received type '{1}'. Consider type-annotating with the expected expression type, e.g., (%% x : {0}) or (%x : {0}).
fi: Tyyppiyhteensopimattomuus pilkottaessa lausetta quotation-vakioon. Lisättävän lausekepuun tyyppi ei vastaa tyyppiä, jota liitosoperaatio odottaa. Odotettu '{0}', mutta vastaanotettiin tyyppi '{1}'. Harkitse kirjoittavasi tyyppimerkintä auki odotetulle lausekkeelle, esimerkiksi (%% x: {0}) tai (% x: {0}).

# QtupleAccessOutOfRange
source: Tuple access out of range
fi: Tuple määritetyn alueen ulkopuolella.

# QtupleLengthsDiffer
source: The tuple lengths are different
fi: Tuplejen pituudet eivät täsmää.

# QunionNeedsDiffNumArgs
source: F# union type requires different number of arguments
fi: F#-unionityyppi vaatii eri määrän argumentteja.

# QwritingGetOnly
source: Writing a get-only property
fi: Vain-get-ominaisuuteen ei voi asettaa.

# QwrongNumOfTypeArgs
source: The method '{0}' expects {1} type arguments but {2} were provided
fi: Menetelmä '{0}' odottaa argumentti tyyppiä {1}, mutta annettu tyyppi on {2}.

# keyNotFoundAlt
source: An index satisfying the predicate was not found in the collection.
fi: Kokoelmasta ei löytynyt hakuehdon täyttävää indeksiä.

# constructorForUnionCaseNotFound
source: The constructor method '{0}' for the union case could not be found
fi: Unionitapauksen konstruktorimenetelmää '{0}' ei löytynyt

# firstClassUsesOfSplice
source: first class uses of '%' or '%%' are not permitted
fi: Ensiluokan käyttö ei ole sallittua: '%' tai '%%'

source: MoveNext not called, or finished
fi: MoveNext-kutsua seuraavaan ei kutsuttu, tai lopetettiin.

# multipleCompilationMappings
source: Multiple CompilationMappingAttributes, expected at most one
fi: Useita CompilationMappingAttributeja, odotettiin korkeintaan yhtä.

# printfBadFloatValue
source: Bad float value
fi: Kelvoton float-arvo.

# printfBadFormatSpecifier
source: Bad format specifier:{0}
fi: Kelvoton muotomääritelmä: {0}

# printfBadIntegerForDynamicFomatter
source: Bad integer supplied to dynamic formatter
fi: Kelvoton kokonaisluku toimitettu dynaamiselle muotoilijalle.

# printfExpectedPrecision
source: Expected a precision argument
fi: Odotettiin tarkkuusargumenttia.

# printfExpectedWidth
source: Expected a width argument
fi: Odotettiin leveysargumenttia.

# printfHashFormatSpecifierIllegal
source: The # formatting modifier is invalid in F#
fi: Muotoilun muokkain # ei ole validi F#-kielessä.

# printfMissingFormatSpecifier
source: Missing format specifier
fi: Muotoiluargumentti on kateissa.

# printfNotAFunType
source: Not a function type
fi: Ei ole kutsuttava funktiotyyppi.

# printfPrecisonSpecifierIllegal
source: Bad format specifier (precision)
fi: Kelvoton (tarkkuus-) muotoilumäärittely.

# printfSpecifierAfterIllegal
source: Bad format specifier (after {0})
fi: Kelvoton muotoilumäärittely ({0} jälkeen).

# printfWidthSpecifierIllegal
source: Bad format specifier (width)
fi: Kelvoton (leveys-) muotoilumäärittely.

# QcannotBindFunction
source: Could not bind function {0} in type {1}
fi: Ei voitu sijoittaa funktiota {0} tyypissä {1}.

# QcannotBindProperty
source: Could not bind property {0} in type {1}
fi: Ei voitu sijoittaa ominaisuutta {0} tyypissä {1}

# QcannotBindToMethod
source: Could not bind to method
fi: Ei voitu asettaa metodiin.

# QcannotTakeAddress
source: Cannot take the address of this quotation
fi: Tämän quotationin osoitetta ei voitu saavuttaa.

# QfailedToBindAssembly
source: Failed to bind assembly '{0}' while processing quotation data
fi: Ei löydetty kirjastoa '{0}' käsiteltäessä quotationia.

# QillFormedAppOrLet
source: ill formed expression: AppOp or LetOp
fi: Kelvottomasti muodostettu lauseke: AppOp tai LetOp

# QtypeArgumentOutOfRange
source: type argument out of range
fi: Alueen ulkopuolinen tyyppiargumentti.

source: This value cannot be mutated
fi: Tätä arvoa ei voi muokata.

# optionValueWasNone
source: The option value was None
fi: Valinnainen arvo oli tyhjä (None).

# controlContinuationInvokedMultipleTimes
source: A continuation provided by Async.FromContinuations was invoked multiple times
fi: Async.FromContinuations -yrityksen jatkamiseen vedottiin useita kertoja.

# invalidRecordTypeConstructorNotDefined
source: The record type '{0}' is invalid. Required constructor is not defined.
fi: Tietuetyyppi '{0}' on virheellinen. Vaadittavaa konstruktoria ei ole määritelty.

# invalidTupleTypeConstructorNotDefined
source: The tuple type '{0}' is invalid. Required constructor is not defined.
fi: Tuple-tyyppi '{0}' on virheellinen. Vaadittavaa konstruktoria ei ole määritelty.

# inputSequenceTooLong
source: The input sequence contains more than one element.
fi: Syötesarja sisältää useita elementtejä.

# thenByError
source: 'thenBy' and 'thenByDescending' may only be used with an ordered input
fi: 'thenBy' ja 'thenByDescending' voidaan käyttää vain järjestetyssä syötteessä

# failDueToUnsupportedInputTypeInSumByOrAverageBy
source: Unrecognized use of a 'sumBy' or 'averageBy' operator in a query. In queries whose original data is of static type IQueryable, these operators may only be used with result type int32, int64, single, double or decimal
fi: Opetaattorin 'sumBy' tai 'averageBy' tuntematon käyttö kyselyssä. Kyselyissä, joiden alkuperäinen tieto on staattista tyyppiä IQueryable, näitä operaattoreita saa käyttää vain tulostyypeille int32, int64, single, double tai decimal.

# unsupportedIfThenElse
source: An if/then/else conditional or pattern matching expression with multiple branches is not permitted in a query. An if/then/else conditional may be used.
fi: Konditionaalisen if/then/else match-lausekkeen käyttö, useahaaraisena, ei ole sallittu kyselyssä. Voit käyttää if/then/else -ehtoa.

# unsupportedQueryConstruct
source: This is not a valid query expression. The following construct was used in a query but is not recognized by the F#-to-LINQ query translator:\n{0}\nCheck the specification of permitted queries and consider moving some of the operations out of the query expression.
fi: Tämä on kelvoton kyselylause. Seuraavaa rakennetta käytettiin kyselyssä, mutta F#-to-LINQ-kääntäjä ei tunnista sitä:\{0}\nTarkista sallittujen kyselyiden määritelmä ja harkitse joidenkin toimintojen siirtämistä kyselylausekkeesta.
