Repository: Microsoft/visualfsharp
Catalog: src/fsharp/FSharp.Core/xlf/FSCore.*.xlf
Languages: fi

# unsupportedQueryCall
source: This is not a valid query expression. The method '{0}' was used in a query but is not recognized by the F#-to-LINQ query translator. Check the specification of permitted queries and consider moving some of the operations out of the query expression
fi: Tämä on kelvoton kyselylause. Menetelmää '{0}' käytettiin kyselyssä, mutta F#-to-LINQ-kääntäjä ei tunnista sitä. Tarkista sallittujen kyselyiden määritelmä ja harkitse joidenkin toimintojen siirtämistä pois kyselylausekkeesta.

# unsupportedQueryProperty
source: This is not a valid query expression. The property '{0}' was used in a query but is not recognized by the F#-to-LINQ query translator. Check the specification of permitted queries and consider moving some of the operations out of the query expression.
fi: Tämä on kelvoton kyselylause. Ominaisuutta '{0}' käytettiin kyselyssä, mutta F#-to-LINQ-kääntäjä ei tunnista sitä. Tarkista sallittujen kyselyiden määritelmä ja harkitse joidenkin toimintojen siirtämistä pois kyselylausekkeesta.

# unsupportedQueryConstructKind
source: This is not a valid query expression. The construct '{0}' was used in a query but is not recognized by the F#-to-LINQ query translator. Check the specification of permitted queries and consider moving some of the operations out of the query expression.
fi: Tämä on kelvoton kyselylause. Rakennetta '{0}' käytettiin kyselyssä, mutta F#-to-LINQ-kyselykääntäjä ei tunnista sitä. Tarkista sallittujen kyselyiden määritelmä ja harkitse joidenkin toimintojen siirtämistä pois kyselylausekkeesta.

# maxDegreeOfParallelismNotPositive
source: maxDegreeOfParallelism must be positive, was {0}
fi: maxDegreeOfParallelism on oltava positiivinen, nähtiin {0}
